test/perf-test/benchmark_logs_20250624_0948/log_20250624_0948_input32_output32_batch32.log
[2025-06-24 09:49:17] Running input_len=32, output_len=32, batch_size=32...
INFO 06-24 09:49:22 [__init__.py:248] No platform detected, vLLM is running on UnspecifiedPlatform
WARNING 06-24 09:49:23 [_custom_ops.py:22] Failed to import from vllm._C with ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
Namespace(backend='vllm', base_url='http://10.10.133.112:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', dataset_name='random', dataset_path=None, max_concurrency=32, model='deepseek', tokenizer='/home/models/DeepSeek-R1-32B/', use_beam_search=False, num_prompts=5, logprobs=None, request_rate=inf, burstiness=1.0, seed=0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir=None, result_filename='/home/llm-infer/test/perf-test/benchmark_logs_20250624_0948/result_20250624_0948_input32_output32_batch32.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, custom_output_len=256, custom_skip_chat_template=False, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, random_input_len=32, random_output_len=32, random_range_ratio=0.0, random_prefix_len=0, hf_subset=None, hf_split=None, hf_output_len=None, top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None)
Starting initial single prompt test run...
Initial test run completed. Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 32
100%|██████████| 5/5 [00:02<00:00,  2.32it/s]
============ Serving Benchmark Result ============
Successful requests:                     5         
Benchmark duration (s):                  2.15      
Total input tokens:                      155       
Total generated tokens:                  160       
Request throughput (req/s):              2.32      
Output token throughput (tok/s):         74.38     
Total Token throughput (tok/s):          146.43    
---------------Time to First Token----------------
Mean TTFT (ms):                          168.01    
Median TTFT (ms):                        167.84    
P99 TTFT (ms):                           169.37    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.89     
Median TPOT (ms):                        63.90     
P99 TPOT (ms):                           63.90     
---------------Inter-token Latency----------------
Mean ITL (ms):                           63.89     
Median ITL (ms):                         63.95     
P99 ITL (ms):                            66.76     
==================================================
[2025-06-24 09:49:30] SUCCESS input_len=32 output_len=32 batch_size=32
---